fio_disk/disk_xfs/log/log_37/sdn/fio_randwrite_08k.log
test: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=5024: Sun Jul 15 09:56:00 2018
  write: IOPS=216, BW=1732KiB/s (1774kB/s)(1024MiB/605414msec)
    slat (nsec): min=2600, max=73992, avg=19774.48, stdev=8533.43
    clat (usec): min=344, max=2159.3k, avg=295586.94, stdev=210634.63
     lat (usec): min=371, max=2159.3k, avg=295607.13, stdev=210636.52
    clat percentiles (msec):
     |  1.00th=[   12],  5.00th=[   20], 10.00th=[   28], 20.00th=[  124],
     | 30.00th=[  186], 40.00th=[  228], 50.00th=[  271], 60.00th=[  313],
     | 70.00th=[  363], 80.00th=[  426], 90.00th=[  575], 95.00th=[  709],
     | 99.00th=[  944], 99.50th=[ 1045], 99.90th=[ 1318], 99.95th=[ 1401],
     | 99.99th=[ 1770]
   bw (  KiB/s): min=   32, max= 5424, per=100.00%, avg=1757.42, stdev=687.41, samples=1188
   iops        : min=    4, max=  678, avg=219.66, stdev=85.93, samples=1188
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.11%, 10=0.59%, 20=4.81%, 50=8.84%
  lat (msec)   : 100=3.59%, 250=27.65%, 500=40.40%, 750=10.06%, 1000=3.23%
  lat (msec)   : 2000=0.69%, >=2000=0.01%
  cpu          : usr=0.26%, sys=0.74%, ctx=128840, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,131072,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=1732KiB/s (1774kB/s), 1732KiB/s-1732KiB/s (1774kB/s-1774kB/s), io=1024MiB (1074MB), run=605414-605414msec

Disk stats (read/write):
  sdn: ios=0/128755, merge=0/1923, ticks=0/38407123, in_queue=38415542, util=100.00%